Repository: Kun686/iTerm2-CN
Catalog: sources/Localizable.xcstrings
Source language: en
Languages: zh_hans

source: Running git in %@ didn’t finish within %@ seconds, so the status bar component can’t show the branch. This often happens in very large repositories or when the working tree is on a slow filesystem. Would you like to increase the timeout to %@ seconds?
zh_hans: 在 %@ 中运行 git 未能在 %@ 秒内完成，因此状态栏组件无法显示分支。这通常发生在非常大的仓库中，或工作树位于较慢的文件系统上。 要将超时时间增加到 %@ 秒吗？

# ui.statusbar.components.itermstatusbargitcomponent.send_command.96f0f269
source: Send Command?
zh_hans: 要发送命令吗？

# ui.statusbar.components.itermstatusbargitcomponent.show_debug_info.4f249724
source: Show Debug Info
zh_hans: 显示调试信息

# ui.statusbar.components.itermstatusbargitcomponent.stash.38bdfeaa
source: Stash
zh_hans: 储藏

source: the current directory
zh_hans: 当前目录

# ui.statusbar.components.itermstatusbargitcomponent.timed_out.f2b0b452
source: ⚠️ timed out
zh_hans: ⚠️ 已超时

source: AI Error
zh_hans: AI 错误

# ui.statusbar.components.itermstatusbarlargecomposerviewcontroller.ok.565339bc
source: OK
zh_hans: 好

source: Always launch this script when iTerm2 starts?
zh_hans: 每次 iTerm2 启动时都运行此脚本吗？

# ui.statusbar.components.itermstatusbarrpcprovidedtextcomponent.cancel.19766ed6
source: Cancel
zh_hans: 取消

source: %@It looks like the script is not running. Launching it might fix the problem.
zh_hans: %@脚本似乎未运行，启动它或许能解决问题。

source: Launch Script
zh_hans: 启动脚本

# ui.statusbar.components.itermstatusbarrpcprovidedtextcomponent.ok.565339bc
source: OK
zh_hans: 好

source: Reveal in Finder
zh_hans: 在访达中显示

source: Status Bar Component Problem
zh_hans: 状态栏组件出现问题

source: Status Bar Script Error
zh_hans: 状态栏脚本错误

source: This will move the script into the AutoLaunch folder.
zh_hans: 这会将脚本移到 AutoLaunch 文件夹。

# ui.statusbar.components.itermstatusbarsnippetcomponent.edit_snippets.dec476c7
source: Edit Snippets…
zh_hans: 编辑片段…

# ui.statusbar.components.itermstatusbarswiftystringcomponent.error.54a0e8c1
source: Error
zh_hans: 错误

# ui.statusbar.components.itermstatusbarswiftystringcomponent.ok.565339bc
source: OK
zh_hans: 好

source: Copy Folder Name
zh_hans: 复制文件夹名称

# ui.statusbar.components.itermstatusbarvariablebasecomponent.copy_path.0e026918
source: Copy Path
zh_hans: 拷贝路径

source: New Session Here in New Tab
zh_hans: 在此处的新标签页中创建会话

source: New Session Here in New Window
zh_hans: 在此处的新窗口中创建会话

# ui.statusbar.core.itermstatusbarcontainerview.configure_status_bar.2efca2ac
source: Configure Status Bar
zh_hans: 配置状态栏

# ui.statusbar.core.itermstatusbarcontainerview.contextual_menu.3db60c37
source: Contextual Menu
zh_hans: 上下文菜单

# ui.statusbar.core.itermstatusbarcontainerview.copy.e21f935f
source: Copy
zh_hans: 拷贝

# ui.statusbar.core.itermstatusbarcontainerview.disable_status_bar.1466e356
source: Disable Status Bar
zh_hans: 禁用状态栏

source: Reset to System Font
zh_hans: 还原为系统字体

# ui.statusbar.setup.itermstatusbarsetupviewcontroller.system_font.a8520e17
source: System Font
zh_hans: 系统字体

source: Configure Action…
zh_hans: 配置操作…

# ui.swift.aiterm.aiconnectiontester.could_not_build_a_request_0.20966816
source: Could not build a request: %1$@
zh_hans: 无法构建请求：%1$@

source: Placeholder key in use: AI responses are simulated for App Review and no external service is contacted.
zh_hans: 正在使用占位密钥：AI 响应会为 App 审核而模拟，不会连接任何外部服务。

source: The connection succeeded. The model responded normally.
zh_hans: 连接成功。模型响应正常。

source: The server responded but its reply could not be understood: %1$@
zh_hans: 服务器已响应，但无法理解其回复：%1$@

# ui.swift.aiterm.aiconnectiontester.the_url_is_not_valid.34088ca6
source: The URL is not valid.
zh_hans: URL 无效。

# ui.swift.aiterm.aimodelcatalogupdater.allow.e213c161
source: Allow
zh_hans: 允许

# ui.swift.aiterm.aimodelcatalogupdater.check_for_ai_model_updates.0fe1780c
source: Check for AI Model Updates?
zh_hans: 检查 AI 模型更新？

# ui.swift.aiterm.aimodelcatalogupdater.don_t_allow.5e0170d3
source: Don’t Allow
zh_hans: 不允许

source: iTerm2 can keep its built-in list of AI models current by periodically downloading a cryptographically signed list from iterm2.com. No terminal content or personal data is sent. Allow this?
zh_hans: iTerm2 可以通过定期从 iterm2.com 下载经过加密签名的列表，使内置 AI 模型列表保持最新。不会发送终端内容或个人数据。允许这样做吗？

source: AI features are not enabled or the API key is missing.
zh_hans: AI 功能尚未启用，或缺少 API 密钥。

# ui.swift.aiterm.aitermcontrollerobjc.thinking.a02f1cea
source: Thinking…
zh_hans: 正在思考…

source: iTerm2 can include this session’s visible screen and terminal state with every message you send in AI chats where you’ve allowed it, so the assistant sees what you see. You can turn this off any time from a chat’s permission settings.
zh_hans: 在您允许的 AI 聊天中，iTerm2 可以随每条消息附上此会话的可见屏幕和终端状态，让助理看到您所看到的内容。您可以随时在聊天的权限设置中关闭此功能。

# ui.swift.aiterm.chatagent.not_now.ccb4c324
source: Not Now
zh_hans: 暂不

# ui.swift.aiterm.chatagent.share_terminal_contents_automatically.9f66d372
source: Share Terminal Contents Automatically?
zh_hans: 自动共享终端内容？

# ui.swift.aiterm.chatagent.turn_on.1154e7fb
source: Turn On
zh_hans: 开启

# ui.swift.aiterm.chatcellview.ai_is_typing.b9adb12b
source: AI is typing…
zh_hans: AI 正在输入…

# ui.swift.aiterm.chatcellview.chat.460b3a7d
source: Chat
zh_hans: 聊天

# ui.swift.aiterm.chatclient.ai_will_not_execute_this_command.5976ab5a
source: AI will not execute this command.
zh_hans: AI 不会执行此命令。

# ui.swift.aiterm.chatclient.i_annotated_0_1_2.fa9b7ea6
source: I [annotated](%1$@) “%2$@”: %3$@
zh_hans: 我[注释了](%1$@)“%2$@”：%3$@

# ui.swift.aiterm.chatclient.you_can_click_on_a_link_in_this.63a2e7e2
source: You can click on a link in this message or on a yellow underline in the terminal to reveal an annotation.
zh_hans: 您可以点击此消息中的链接或终端中的黄色下划线来显示注释。

# ui.swift.aiterm.chatdatabase.terminal.4e686af7
source: terminal
zh_hans: 终端

# ui.swift.aiterm.chatdatabase.this_chat_is_no_longer_linked_to_a.06722177
source: This chat is no longer linked to a %1$@ session.
zh_hans: 此聊天已不再链接%1$@会话。

# ui.swift.aiterm.chatdatabase.web_browser.7e16b4a1
source: web browser
zh_hans: 网页浏览器

# ui.swift.aiterm.chatfindbarview.0_of_1.9fea8201
source: %1$lld of %2$lld
zh_hans: %1$lld/%2$lld

# ui.swift.aiterm.chatfindbarview.close_find_bar.3b77ad7b
source: Close find bar
zh_hans: 关闭查找栏

# ui.swift.aiterm.chatfindbarview.find_in_conversation.d60bac74
source: Find in Conversation
zh_hans: 在对话中查找

# ui.swift.aiterm.chatfindbarview.find_next.664d6cdf
source: Find Next
zh_hans: 查找下一个

# ui.swift.aiterm.chatfindbarview.find_previous.bf0e5179
source: Find Previous
zh_hans: 查找上一个

# ui.swift.aiterm.chatfindbarview.ignore_case.a26ced7d
source: Ignore Case
zh_hans: 忽略大小写

# ui.swift.aiterm.chatfindbarview.match_case.f3766f1d
source: Match Case
zh_hans: 区分大小写

# ui.swift.aiterm.chatfindbarview.no_results.a43619f3
source: No results
zh_hans: 无结果

# ui.swift.aiterm.chatfindbarview.regular_expression.2aa42833
source: Regular Expression
zh_hans: 正则表达式

# ui.swift.aiterm.chatfindbarview.smart_case.cd8e87d2
source: Smart Case
zh_hans: 智能大小写

# ui.swift.aiterm.chatinputview.0_doesn_t_accept_this_file_type_as.6b381aa2
source: %1$@ doesn’t accept this file type as a chat attachment: %2$@.
zh_hans: %1$@不接受此文件类型作为聊天附件：%2$@。

# ui.swift.aiterm.chatinputview.add_0_to_your_message_as_an_attachment.e042141b
source: Add “%1$@” to your message as an attachment, or insert its path as text?
zh_hans: 要将“%1$@”作为附件添加到消息中，还是以文本形式插入其路径？

# ui.swift.aiterm.chatinputview.add_the_0_dropped_files_to_your_message.06110db2
source: Add the %1$lld dropped files to your message as attachments, or insert their paths as text?
zh_hans: 要将拖入的 %1$lld 个文件作为附件添加到消息中，还是以文本形式插入其路径？

# ui.swift.aiterm.chatinputview.attach.d406ade2
source: Attach
zh_hans: 附加

# ui.swift.aiterm.chatinputview.attach_file.70404d29
source: Attach File?
zh_hans: 附加文件？

# ui.swift.aiterm.chatinputview.attach_files.231a7007
source: Attach Files?
zh_hans: 附加文件？

# ui.swift.aiterm.chatinputview.attach_files.e697cc1e
source: Attach files
zh_hans: 附加文件

# ui.swift.aiterm.chatinputview.attachment_not_supported.2fd3b239
source: Attachment not supported
zh_hans: 不支持此附件

# ui.swift.aiterm.chatinputview.attachments_not_supported.ddd4c4e4
source: Attachments not supported
zh_hans: 不支持这些附件

# ui.swift.aiterm.chatinputview.insert_path.0a7164b7
source: Insert Path
zh_hans: 插入路径

# ui.swift.aiterm.chatinputview.ok.565339bc
source: OK
zh_hans: 好

# ui.swift.aiterm.chatinputview.send.f6f4688f
source: Send
zh_hans: 发送

# ui.swift.aiterm.chatinputview.stop.cae7d57b
source: Stop
zh_hans: 停止

# ui.swift.aiterm.chatinputview.the_current_ai_provider.937d613c
source: the current AI provider
zh_hans: 当前 AI 提供商

# ui.swift.aiterm.chatinputview.to_submit.183f2849
source: ↩ to submit
zh_hans: ↩ 发送

# ui.swift.aiterm.chatinputview.type_a_message.04711048
source: Type a message…
zh_hans: 输入消息…

# ui.swift.aiterm.chatinputview.type_a_message_or_to_mention_a_session.e4d7a5ac
source: Type a message, or @ to mention a session…
zh_hans: 输入消息，或使用 @ 提及会话…

# ui.swift.aiterm.chatlistviewcontroller.delete_0_chats.9f072630
source: Delete %1$lld Chats
zh_hans: 删除 %1$lld 个聊天

# ui.swift.aiterm.chatlistviewcontroller.delete_chat.19f91760
source: Delete Chat
zh_hans: 删除聊天

# ui.swift.aiterm.chatlistviewcontroller.rename_chat.a257dec8
source: Rename Chat
zh_hans: 重命名聊天

# ui.swift.aiterm.chatmentionpickercontroller.tab_0.675919b9
source: Tab %1$lld
zh_hans: 标签页 %1$lld

# ui.swift.aiterm.chatmentionpickercontroller.tab_0_1.fe0680b5
source: Tab %1$lld · %2$@
zh_hans: 标签页 %1$lld · %2$@

# ui.swift.aiterm.chatmentionpickercontroller.window_0.38ae7a46
source: Window %1$d
zh_hans: 窗口 %1$d

# ui.swift.aiterm.chatmentionpickercontroller.workgroup.a6d32d72
source: Workgroup
zh_hans: 工作组

# ui.swift.aiterm.chatsessionmentionattachment.iterm2_session.0895478c
source: iTerm2 session
zh_hans: iTerm2 会话

# ui.swift.aiterm.chatsessionmentionattachment.untitled_session.3d9b66fd
source: Untitled session
zh_hans: 未命名会话

# ui.swift.aiterm.chatsplitviewcontroller.hide_chat_list.d4cf3996
source: Hide chat list
zh_hans: 隐藏聊天列表

# ui.swift.aiterm.chatsplitviewcontroller.show_chat_list.0cec9e66
source: Show chat list
zh_hans: 显示聊天列表

# ui.swift.aiterm.chatsplitviewcontroller.toggle_chat_list.1b57d229
source: Toggle Chat List
zh_hans: 切换聊天列表

# ui.swift.aiterm.chattitlestyling.orchestrator_chat.3e61b07d
source: Orchestrator chat
zh_hans: 编排器聊天

# ui.swift.aiterm.chattoolbar.ai_chat.fe98f42c
source: AI Chat
zh_hans: AI 聊天

# ui.swift.aiterm.chattoolbar.allow_ai_to_perform_web_search.a202d37f
source: Allow AI to perform web search?
zh_hans: 允许 AI 执行网页搜索吗？

# ui.swift.aiterm.chattoolbar.auto.02862497
source: Auto
zh_hans: 自动

# ui.swift.aiterm.chattoolbar.effort_0.f683123a
source: Effort: %1$@
zh_hans: 推理强度：%1$@

# ui.swift.aiterm.chattoolbar.enable_high_effort_reasoning.b3166298
source: Enable high-effort reasoning?
zh_hans: 启用高强度推理？

source: Enable high-effort reasoning? Slower but may produce better results.
zh_hans: 启用高强度推理？速度较慢，但可能产生更好的结果。

# ui.swift.aiterm.chattoolbar.flex_slow.56d9fb37
source: Flex (Slow)
zh_hans: Flex（慢速）

# ui.swift.aiterm.chattoolbar.high.c4ebc6d4
source: High
zh_hans: 高

# ui.swift.aiterm.chattoolbar.llama_local.2933c0ec
source: Llama (Local)
zh_hans: Llama（本地）

# ui.swift.aiterm.chattoolbar.low.f793de20
source: Low
zh_hans: 低

# ui.swift.aiterm.chattoolbar.medium.8e588cd1
source: Medium
zh_hans: 中

# ui.swift.aiterm.chattoolbar.minimal.057b5de4
source: Minimal
zh_hans: 最低

# ui.swift.aiterm.chattoolbar.none.dc937b59
source: None
zh_hans: 无

# ui.swift.aiterm.chattoolbar.only_one_model_is_available_for_this_chat.f1d8eb69
source: Only one model is available for this chat.
zh_hans: 此聊天仅有一个可用模型。

# ui.swift.aiterm.chattoolbar.priority_fast.d263dd37
source: Priority (Fast)
zh_hans: Priority（快速）

# ui.swift.aiterm.chattoolbar.provider.472590ae
source: Provider
zh_hans: 提供商

# ui.swift.aiterm.chattoolbar.select_a_model_for_this_chat.d19285c6
source: Select a model for this chat.
zh_hans: 选择此聊天使用的模型。

# ui.swift.aiterm.chattoolbar.select_a_model_for_this_chat_the_provider.1f104d49
source: Select a model for this chat. The provider is fixed after the chat is created.
zh_hans: 选择此聊天使用的模型。聊天创建后无法更改提供商。

source: Select OpenAI service tier. Priority is faster; Flex is lower-cost and slower.
zh_hans: 选择 OpenAI 服务等级。Priority 速度更快；Flex 成本更低但速度更慢。

source: Select reasoning effort for models that support it
zh_hans: 为支持的模型选择推理强度

# ui.swift.aiterm.chattoolbar.select_the_ai_provider_for_this_chat_before.3d2d7349
source: Select the AI provider for this chat before sending the first message.
zh_hans: 请在发送第一条消息前选择此聊天使用的 AI 提供商。

# ui.swift.aiterm.chattoolbar.standard.ef669154
source: Standard
zh_hans: 标准

# ui.swift.aiterm.chattoolbar.the_model_is_fixed_after_the_chat_starts.06ea7078
source: The model is fixed after the chat starts.
zh_hans: 聊天开始后无法更改模型。

# ui.swift.aiterm.chattoolbar.the_provider_is_fixed_after_the_first_real.dfb1dccf
source: The provider is fixed after the first real message in a chat.
zh_hans: 发送第一条实际消息后，将无法更改此聊天的提供商。

# ui.swift.aiterm.chattoolbar.tier_0.cce1cfac
source: Tier: %1$@
zh_hans: 服务层级：%1$@

# ui.swift.aiterm.chattoolbar.web_search_image.40377dd4
source: Web search image
zh_hans: 网页搜索图标

# ui.swift.aiterm.chattoolbar.xhigh.0704c8f3
source: XHigh
zh_hans: 极高

# ui.swift.aiterm.chatviewcontroller.a_vector_store_was_created.0b695c3d
source: A vector store was created
zh_hans: 已创建向量存储

source: AI attempted to perform an action, but no %1$@ session is linked to this chat so it failed.
zh_hans: AI 尝试执行操作，但此聊天未链接%1$@会话，因此操作失败。

# ui.swift.aiterm.chatviewcontroller.ai_chat.fe98f42c
source: AI Chat
zh_hans: AI 聊天

source: All terminal commands in the linked session will be sent to AI automatically.
zh_hans: 链接会话中的所有终端命令都将自动发送给 AI。

source: All terminal content will be sent to AI, which may go to a third party. Ensure this is safe to do before proceeding.
zh_hans: 所有终端内容都将发送给 AI，并可能发送给第三方。继续前请确认这样做是安全的。

# ui.swift.aiterm.chatviewcontroller.allow_agent_to_control_0_1_2.06358b2b
source: **Allow agent to control %1$@ “%2$@”?** %3$@
zh_hans: **允许代理控制%1$@“%2$@”？** %3$@

# ui.swift.aiterm.chatviewcontroller.allow_once.18e34d7e
source: Allow Once
zh_hans: 允许一次

# ui.swift.aiterm.chatviewcontroller.allow_repeated_screen_reads_0.3572ad6c
source: **Allow repeated screen reads?** %1$@
zh_hans: **允许重复读取屏幕？** %1$@

# ui.swift.aiterm.chatviewcontroller.always.de9f057a
source: Always
zh_hans: 始终

# ui.swift.aiterm.chatviewcontroller.always_allow.80584802
source: Always Allow
zh_hans: 始终允许

# ui.swift.aiterm.chatviewcontroller.always_deny.f9fd413a
source: Always Deny
zh_hans: 始终拒绝

# ui.swift.aiterm.chatviewcontroller.approve.6007acbe
source: Approve
zh_hans: 批准

# ui.swift.aiterm.chatviewcontroller.are_you_sure_you_want_to_delete_this.43560a32
source: Are you sure you want to delete this chat? This action cannot be undone.
zh_hans: 确定要删除此聊天吗？此操作无法撤销。

# ui.swift.aiterm.chatviewcontroller.ask.b8c209cd
source: Ask
zh_hans: 询问

# ui.swift.aiterm.chatviewcontroller.ask_each_time.34d2f064
source: Ask Each Time
zh_hans: 每次询问

# ui.swift.aiterm.chatviewcontroller.browser.d4c3e8a1
source: browser
zh_hans: 浏览器

# ui.swift.aiterm.chatviewcontroller.cancel.19766ed6
source: Cancel
zh_hans: 取消

# ui.swift.aiterm.chatviewcontroller.confirm_change.3a8db975
source: Confirm Change
zh_hans: 确认更改

# ui.swift.aiterm.chatviewcontroller.delete.e2d0a549
source: Delete
zh_hans: 删除

# ui.swift.aiterm.chatviewcontroller.delete_chat.b4973d03
source: Delete Chat?
zh_hans: 删除聊天？

# ui.swift.aiterm.chatviewcontroller.deny.05a2d733
source: Deny
zh_hans: 拒绝

# ui.swift.aiterm.chatviewcontroller.deny_this_time.678b0b05
source: Deny this Time
zh_hans: 本次拒绝

# ui.swift.aiterm.chatviewcontroller.disable_orchestration.d7c121e1
source: Disable Orchestration
zh_hans: 停用编排

# ui.swift.aiterm.chatviewcontroller.enable_orchestration.2de3a21a
source: Enable Orchestration
zh_hans: 启用编排

source: **Enable orchestration for this chat?** **Orchestration** lets the AI coordinate across multiple terminal sessions. It can read the contents of any session, and you grant a one-time approval before it controls a session instead of approving every call. It also runs in **auto mode**: each command the AI proposes is checked for safety by your AI provider, and anything risky is held for your review.
zh_hans: **为此聊天启用编排？** **编排**允许 AI 协调多个终端会话。它可以读取任意会话的内容；在控制某个会话前，您只需为该会话授予一次批准，而无需批准每次调用。它还会以**自动模式**运行：AI 建议的每条命令都会由您的 AI 提供商检查安全性，任何有风险的操作都会等待您审核。

# ui.swift.aiterm.chatviewcontroller.enable_orchestration_mode.afb95915
source: Enable orchestration mode?
zh_hans: 启用编排模式？

source: **Enable orchestration?** Orchestration mode lets the agent read screen contents from any session. To type into a session still requires your permission. This is a more permissive model than when an agent is linked to a single session, where there are very fine-grained permission settings. Enabling will detach any linked terminal or browser session and switch the chat to Orchestration mode.
zh_hans: **启用编排？** 编排模式允许代理读取任意会话的屏幕内容。要在会话中输入内容仍需获得您的许可。 与代理只链接单个会话时相比，此模式的权限范围更宽；链接单个会话时可使用非常细粒度的权限设置。 启用后将分离所有已链接的终端或浏览器会话，并将聊天切换到编排模式。

source: Explain the output of %1$@ based on [attached terminal content](%2$@).
zh_hans: 请根据[附加的终端内容](%2$@)解释 %1$@ 的输出。

source: Explain the output of %1$@ based on some no-longer-available content.
zh_hans: 请根据部分已不可用的内容解释 %1$@ 的输出。

source: **Granted this chat permission to control “%1$@”.** You @-mentioned it, so the agent can act there without asking. Revoke to require approval again.
zh_hans: **已授予此聊天控制“%1$@”的权限。** 您通过 @ 提及了它，因此代理无需询问即可在那里执行操作。撤销权限后将再次要求批准。

# ui.swift.aiterm.chatviewcontroller.help.b79cac92
source: Help
zh_hans: 帮助

source: *If you grant or deny permission, it affects only this chat conversation while linked to this particular terminal session. You can change permissions in the chat Info menu.*
zh_hans: *授予或拒绝权限只会影响此聊天与当前终端会话链接期间的对话。您可以在聊天的“信息”菜单中更改权限。*

# ui.swift.aiterm.chatviewcontroller.link.a6a32dbc
source: Link
zh_hans: 链接

# ui.swift.aiterm.chatviewcontroller.link_browser_session.211d5e08
source: Link Browser Session
zh_hans: 链接浏览器会话

# ui.swift.aiterm.chatviewcontroller.link_terminal_session.1f7d11da
source: Link Terminal Session
zh_hans: 链接终端会话

# ui.swift.aiterm.chatviewcontroller.link_this_chat_to_0_session_1_or.673a85d3
source: **Link this chat to %1$@ session “%2$@”, or enable orchestration?** Linking gives the AI access to this %3$@ session subject to your per-call permission. **Orchestration** is an alternative mode where the AI can coordinate multiple sessions. It uses automatic safety checking and one-time per-session approval instead of fine-grained permissions.
zh_hans: **将此聊天链接到%1$@会话“%2$@”，还是启用编排？** 链接后，AI 可在逐次调用权限的约束下访问此%3$@会话。**编排**是另一种模式，AI 可在其中协调多个会话。它使用自动安全检查和每个会话的一次性批准，而不是细粒度权限。

# ui.swift.aiterm.chatviewcontroller.link_this_session_to_ai_chat.cefc592e
source: Link this session to AI chat?
zh_hans: 将此会话链接到 AI 聊天？

# ui.swift.aiterm.chatviewcontroller.never.6300ef80
source: Never
zh_hans: 永不

# ui.swift.aiterm.chatviewcontroller.never_allow.0bb84364
source: Never Allow
zh_hans: 永不允许

# ui.swift.aiterm.chatviewcontroller.no_chats.8fe13081
source: No Chats
zh_hans: 没有聊天

# ui.swift.aiterm.chatviewcontroller.not_now.ccb4c324
source: Not Now
zh_hans: 暂不

source: *Note: The command output was truncated because it exceeded the maximum number of lines supported by AI Chat*
zh_hans: *注：命令输出超过 AI 聊天支持的最大行数，因此已被截断*

# ui.swift.aiterm.chatviewcontroller.ok.565339bc
source: OK
zh_hans: 好

# ui.swift.aiterm.chatviewcontroller.open_a_new_session_0.fa187ac2
source: **Open a new session?** %1$@
zh_hans: **打开新会话？** %1$@

# ui.swift.aiterm.chatviewcontroller.orchestration_disabled.8f1c03d4
source: Orchestration disabled.
zh_hans: 已停用编排。

source: Orchestration enabled. Agent can see content of all sessions.
zh_hans: 已启用编排。代理可以查看所有会话的内容。

source: Orchestration mode lets the agent coordinate across any iTerm2 sessions. It can read screen contents from any session, but to type into a session requires your permission. This is a more permissive model than when an agent is linked to a single session, where there are very fine-grained permission settings. Enabling will detach any linked terminal or browser session and switch the chat to Orchestration mode.
zh_hans: 编排模式允许代理在任意 iTerm2 会话之间进行协调。它可以读取任意会话的屏幕内容，但要在会话中输入内容仍需获得您的许可。与代理仅链接到单个会话时可使用的细粒度权限设置相比，此模式的权限范围更广。 启用后将取消链接任何已链接的终端或浏览器会话，并将聊天切换到编排模式。

# ui.swift.aiterm.chatviewcontroller.privacy_warning.4555da28
source: Privacy Warning
zh_hans: 隐私警告

# ui.swift.aiterm.chatviewcontroller.provided_automatically.b4e4645d
source: Provided automatically
zh_hans: 自动提供

# ui.swift.aiterm.chatviewcontroller.put_chat_in_linked_browser_session.ae06da7c
source: Put Chat in Linked Browser Session
zh_hans: 将聊天放入已链接的浏览器会话

# ui.swift.aiterm.chatviewcontroller.put_chat_in_linked_terminal_session.fc059bc0
source: Put Chat in Linked Terminal Session
zh_hans: 将聊天放入已链接的终端会话

# ui.swift.aiterm.chatviewcontroller.reveal_linked_terminal_session.83bf85e6
source: Reveal Linked Terminal Session
zh_hans: 显示已链接的终端会话

# ui.swift.aiterm.chatviewcontroller.reveal_linked_web_browser_session.b40eecf0
source: Reveal Linked Web Browser Session
zh_hans: 显示已链接的网页浏览器会话

# ui.swift.aiterm.chatviewcontroller.revoke.87e6d00b
source: Revoke
zh_hans: 撤销授权

# ui.swift.aiterm.chatviewcontroller.run_this_command_0.f4e5cd9b
source: **Run this command?** %1$@
zh_hans: **运行此命令？** %1$@

# ui.swift.aiterm.chatviewcontroller.select_a_session.869da394
source: Select a Session
zh_hans: 选择会话

# ui.swift.aiterm.chatviewcontroller.send_automatically.ad124756
source: Send Automatically
zh_hans: 自动发送

source: Send Commands & Output to AI Automatically
zh_hans: 自动将命令和输出发送给 AI

# ui.swift.aiterm.chatviewcontroller.session.3f3af1ec
source: session
zh_hans: 会话

# ui.swift.aiterm.chatviewcontroller.stop.cae7d57b
source: Stop
zh_hans: 停止

# ui.swift.aiterm.chatviewcontroller.terminal.4e686af7
source: terminal
zh_hans: 终端

source: Terminal commands will no longer be sent to AI automatically.
zh_hans: 终端命令将不再自动发送给 AI。

source: Terminal commands will no longer be sent to AI automatically. Automatic sending always terminates when iTerm2 restarts or the current chat changes.
zh_hans: 终端命令将不再自动发送给 AI。iTerm2 重新启动或当前聊天发生变化时，自动发送始终会终止。

source: The AI agent needs to run commands in a live %1$@ session, but none is attached to this chat.
zh_hans: AI 代理需要在实时%1$@会话中运行命令，但此聊天未附加此类会话。

source: ⚠️ **The AI safety check flagged this command as potentially dangerous. Review it with care.**
zh_hans: ⚠️ **AI 安全检查将此命令标记为可能存在危险。请仔细检查。**

source: This chat has been linked to %1$@ session “%2$@”
zh_hans: 此聊天已链接到%1$@会话“%2$@”

# ui.swift.aiterm.chatviewcontroller.this_chat_is_no_longer_linked_to_a.01480b8b
source: This chat is no longer linked to a terminal session.
zh_hans: 此聊天已不再链接终端会话。

# ui.swift.aiterm.chatviewcontroller.this_chat_is_no_longer_linked_to_a.a7eeb0ec
source: This chat is no longer linked to a web browser session.
zh_hans: 此聊天已不再链接网页浏览器会话。

# ui.swift.aiterm.chatviewcontroller.this_chat_is_not_linked_to_any_0.c63fd27d
source: This chat is not linked to any %1$@ session.
zh_hans: 此聊天未链接任何%1$@会话。

source: This message requires a newer version of iTerm2 to view.
zh_hans: 需要使用更高版本的 iTerm2 才能查看此消息。

# ui.swift.aiterm.chatviewcontroller.unlink_terminal_session.f8a3b2c2
source: Unlink Terminal Session
zh_hans: 取消链接终端会话

# ui.swift.aiterm.chatviewcontroller.unlink_web_browser_session.e48325ce
source: Unlink Web Browser Session
zh_hans: 取消链接网页浏览器会话

# ui.swift.aiterm.chatviewcontroller.unnamed_session.2bfc3707
source: (Unnamed session)
zh_hans: （未命名会话）

# ui.swift.aiterm.chatviewcontroller.unnamed_session.f1ff2801
source: Unnamed session
zh_hans: 未命名会话

# ui.swift.aiterm.chatviewcontroller.untitled_chat.84f4df45
source: Untitled Chat
zh_hans: 未命名聊天

# ui.swift.aiterm.chatviewcontroller.waiting_for_a_session_to_be_selected.54585b98
source: Waiting for a session to be selected…
zh_hans: 正在等待选择会话…

# ui.swift.aiterm.chatviewcontroller.web_browser.7e16b4a1
source: web browser
zh_hans: 网页浏览器
